<template>
  <Button class="is-icon is-kakao" label="카카오 간편가입">
    <template #icon>
      <svg class="mr-[0.4rem]" width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M7.99976 1.5C4.13374 1.5 0.999756 3.98651 0.999756 7.05373C0.999756 9.03674 2.30997 10.7768 4.28087 11.7593C4.17365 12.1314 3.59184 14.1531 3.56869 14.3119C3.56869 14.3119 3.55476 14.4312 3.63155 14.4768C3.70835 14.5223 3.79868 14.4869 3.79868 14.4869C4.01891 14.456 6.35253 12.8065 6.75645 12.5201C7.15996 12.5776 7.57545 12.6075 7.99976 12.6075C11.8658 12.6075 14.9998 10.121 14.9998 7.05373C14.9998 3.98651 11.8658 1.5 7.99976 1.5Z"
          fill="black"
        />
      </svg>
    </template>
  </Button>
</template>

<script setup></script>

<style lang="scss" scoped></style>
